<template>
  <div class="app-documentation">
    <app-pagename
      name="Докуметація"
      routeWay="Головна >> Про коледж >> Докуметація"
    ></app-pagename>

    <div class="app-documentation__content container">
      <div class="app-documentation__item-links">
        <document-link
          class="app-documentation__link"
          v-for="({ name, link }, index) in firstList"
          :key="index"
          :link="link"
          >{{ name }}</document-link>
      </div>

      <div class="app-documentation__item-text">
        <p>
          1.  Відповідно до листа Міністерства освіти і науки України від 18.05.2015 року 
          № 1/9-247 повідомляємо, що згідно до частини сьомої статті 7 Закону України 
          «Про вищу освіту» вищі навчальні заклади виготовляють документи про вищу освіту, 
          при цьому гранична вартість документів про вищу освіту державного зразка та 
          перелік інформації, яка повинна міститися у документі про вищу освіту 
          встановлюється Кабінетом Міністрів України.<br />

          На виконання вказаних норм Кабінетом Міністрів України прийнято постанову 
          від 31 березня 2015 р. № 193 «Про документи про вищу освіту (наукові ступені) 
          державного зразка», якою:<br />

          <b>
          - затверджено перелік інформації, яка повинна міститись у документах про вищу освіту
            (наукові ступені);<br />
            
          - встановлено, що гранична вартість виготовлення документа про вищу 
          освіту державного зразка не повинна перевищувати двох 
          неоподатковуваних мінімумів доходів громадян (34 гривні).
          </b>
        </p>

        <p>
          2. Згідно наказу “МІНІСТЕРСТВА ОСВІТИ І НАУКИ УКРАЇНИ” від 19.02.2015 року 
          №166 “Деякі питання оприлюднення інформації про діяльність вищих 
          навчальних закладів” та відповідно до підпункту 3 частини другої статті 16, 
          пункту 4 частини третьої статті 32, частини першої статті 79 Закону України 
          “Про вищу освіту”, Закону України “Про доступ до публічної інформації”, Закону 
          України “Про засади запобігання і протидії корупції”, Бюджетного кодексу України, 
          а також з метою забезпечення відкритості та прозорості прийняття рішень 
          керівниками вищих навчальних закладів надаємо інформацію.
        </p>
      </div>

      <div class="app-documentation__item-links">
        <document-link
          class="app-documentation__link"
          v-for="({ name, link }, index) in secondList"
          :key="index"
          :link="link"
          >{{ name }}</document-link>
      </div>
    </div>
  </div>
</template>

<script>
import AppPagename from '@/components/ui/AppPagename.vue'
import DocumentLink from '@/components/ui/DocumentLink.vue'

export default {
  components: {
    AppPagename,
    DocumentLink,
  },
  data() {
    return {
      firstList: [
        {
          name: 'Результати вибору електронних версій оригінал-макетів підручників для 11 класу закладів загальної освіти , поданих на конкурсний відбір проектів підручників для 6 та 11 класів закладів середньої освіти',
          link: 'http://kpk-lp.com.ua/wp-content/uploads/2019/03/%D0%9F%D1%83%D0%B1%D0%BB%D1%96%D1%87%D0%BD%D0%B0-%D1%96%D0%BD%D1%84%D0%BE%D1%80%D0%BC%D0%B0%D1%86%D1%96%D1%8F-%D0%BF%D0%BE-%D0%BF%D1%96%D0%B4%D1%80%D1%83%D1%87%D0%BD%D0%B8%D0%BA%D0%B0%D1%85.pdf',
        },
        {
          name: 'Витяг з протоколу №7 засідання педагогічної ради від 26.04.2018 р. про результати вибору електронних версій оригінал-макетів підручників',
          link: 'http://kpk-lp.com.ua/wp-content/uploads/2018/04/%D0%B2%D0%B8%D1%82%D1%8F%D0%B3-%D0%B7-%D0%BF%D1%80%D0%BE%D1%82%D0%BE%D0%BA%D0%BE%D0%BB%D1%83-%E2%84%967%D0%BF%D1%96%D0%B4%D1%80%D1%83%D1%87%D0%BD%D0%B8%D0%BA%D0%B8.pdf',
        },
      ],
      secondList: [
        {
          name: 'Положення про відокремлений структурний підрозділ – Коломийський політехнічний коледж національного університету “Львівська політехніка”',
          link: 'http://kpk-lp.com.ua/wp-content/uploads/2017/11/jpg2pdf.pdf',
        },
        {
          name: 'Наказ про затвердження положення про відокремлений структурний підрозділ – Коломийський політехнічний коледж національного університету “Львівська політехніка”',
          link: 'http://kpk-lp.com.ua/wp-content/uploads/2017/11/%D0%9D%D0%B0%D0%BA%D0%B0%D0%B7-%D0%BF%D1%80%D0%BE-%D0%B7%D0%B0%D1%82%D0%B2%D0%B5%D1%80%D0%B4%D0%B6%D0%B5%D0%BD%D0%BD%D1%8F.jpg',
        },
        {
          name: 'Наказ на зміну наказу про затвердження положення про відокремлений структурний підрозділ – Коломийський політехнічний коледж національного університету “Львівська політехніка”',
          link: 'http://kpk-lp.com.ua/wp-content/uploads/2017/11/%D0%97%D0%BC%D1%96%D0%BD%D0%B8-%D0%B4%D0%BE-%D0%BD%D0%B0%D0%BA%D0%B0%D0%B7%D1%83.jpg',
        },
        {
          name: 'Кошторис на 2019 рік',
          link: 'http://kpk-lp.com.ua/wp-content/uploads/2019/01/%D0%9A%D0%BE%D1%88%D1%82%D0%BE%D1%80%D0%B8%D1%81-%D0%BD%D0%B0-2019-%D1%80%D1%96%D0%BA.pdf',
        },
        {
          name: 'Річний план закупівель на 2019 рік',
          link: 'http://kpk-lp.com.ua/wp-content/uploads/2019/02/%D0%A0%D1%96%D1%87%D0%BD%D0%B8%D0%B9-%D0%BF%D0%BB%D0%B0%D0%BD-%D0%B7%D0%B0%D0%BA%D1%83%D0%BF%D1%96%D0%B2%D0%B5%D0%BB%D1%8C-%D0%BD%D0%B0-2019-%D1%80..pdf',
        },
      ],
    }
  },
}
</script>

<style lang="less" scoped>
.app-documentation {
  
  &__item{

    &-text{

      p{
        margin: 40px 0;

        text-indent: 40px;
        line-height: 30px;
      }
    }

  }
}
</style>
