<template>
  <div class="app-about">
    <app-pagename
      name="Про бібліотеку"
      routeWay="Головна >> Бібліотека >> Про бібліотеку"
    ></app-pagename>

    <div class="app-about__content container">
      <div class="app-about__item">
        <div class="app-about__item-text">
          <p><b>
            Бібліотека – осередок культури, національної пам’яті, одна знайважливіших
            ланок людської цивілізації, незмінне джерело і показовий елемент прогресу.
          </b></p>

          <p>
            Вона прагне до формування системи інформаційної підтримки освіти.
            Бібліотека  – установа, в якій зберігаються зібрані твори друку і писемності
            для суспільного користування, також там здійснюється довідково-бібліографічна робота.
          </p>
        </div>


        <app-image
          class="app-about__item-image"
          :link="photo.images[0].path"
          position="right"
          ></app-image>

        <div class="app-about__item-text">
          <p>
            Історія бібліотеки коледжу тісно пов’язана з створенням навчального закладу починаючи з
            1894р. формувався фонд бібліотеки, література була переважно технічного профілю.
            За період 1946-1960 років фонд бібліотеки значно збільшився . В бібліотеці
            працювало два працівники, завідувачем бібліотекою була Дмітрієва Катерина Василівна.
            До 1982 року бібліотека знаходилась в головному корпусі, там було книгосховище і
            кафедра видачі літератури. В 1982 році було збудовано новий корпус, куди і було
            перенесено бібліотеку, фонд становив 30 тисяч примірників книг. Бібліотеку очолювала
            з 1982-2012 роки Петруняк Марія Олексіївна. Площа бібліотеки становить 180 кв.м.,
            фонд в 2014 році нараховує 47496 примірників книг та періодичних видань. Бібліотека
            коледжу забезпечує студентів необхідними книгами, підручниками, посібниками,
            довідковими та періодичними виданнями. Бібліотека і навчальний заклад функціонують
            в єдиному інформаційному просторі і мають одну стратегічну задачу – забезпечити
            підготовку фахівців, що відповідають сучасним вимогам. Саме  бібліотека є головним
            інформаційним центром коледжу.
          </p>
        </div>

        <app-image
          class="app-about__item-image"
          :link="photo.images[1].path"
          position="left"
          ></app-image>

        <div class="app-about__item-text">
          <p>
            Сучасній бібліотеці недостатньо мати інформацію, потрібно організувати
            доступ до неї в зручній для користувача формі. У бібліотеку прийшло нове
            покоління користувачів, добре обізнаних з комп’ютерною технікою, роботою
            в Інтернеті. Тому роль бібліотекаря як консультанта, інформаційного
            посередника між користувачем і різноманітними базами даних набула особливого
            значення. Одним із пріоритетних напрямів роботи бібліотеки є створення
            джерел бібліографічної інформації, а також електронних ресурсів на їх основі.
          </p>

          <p>
            Комп’ютерна техніка у бібліотеці прискорює процес отримання і опрацювання
            інформації, швидкому пошуку літератури, оперативному аналізу книгозабезпечуваності.
            Всі комп’ютери підключені до мережі Internet.
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import { mapActions } from 'vuex'

import AppPagename from '@/components/ui/AppPagename.vue'
import AppImage from '@/components/ui/AppImage.vue'

export default {
  components: {
    AppPagename,
    AppImage,
  },
  data() {
    return {
      photo: [],
    }
  },
  methods: {
    ...mapActions({
      loadImages: 'images/loadImages',
    }),
  },
  async created() {
    this.photo = await this.loadImages(['5ebd605e36626b233ccd1fc2', '5ebd5ebb36626b233ccd1fc1'])
  },
}
</script>

<style lang="less" scoped>
.app-about {

  &__item{
    display: grid;
    grid-template-areas:
      "text1 image1"
      "text2 text2"
      "image2 text3";
    grid-gap: 50px;

    &-text:nth-of-type(1){
      grid-area: text1;
    }
    &-text:nth-of-type(3){
      grid-area: text2;
    }
    &-text:nth-of-type(5){
      grid-area: text3;
    }

    &-image:nth-of-type(2){
      grid-area: image1;
    }
    &-image:nth-of-type(4){
      grid-area: image2;
    }
  }

  @media screen and (max-width: 1195px)  {

    &__item{
      display: block;
    }
  }
}
</style>
